pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_ppr_peripherals.h
/*

Copyright (c) 2010 - 2025, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF9230_ENGB_PPR_PERIPHERALS_H
#define NRF9230_ENGB_PPR_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*VPR CSR registers*/
#define VPRCSR_PRESENT 1
#define VPRCSR_COUNT 1

#define VPRCSR_HARTNUM 11
#define VPRCSR_MCLICBASERESET 0x5F909000
#define VPRCSR_MULDIV 1
#define VPRCSR_HIBERNATE 1
#define VPRCSR_DBG 1
#define VPRCSR_REMAP 0
#define VPRCSR_BUSWIDTH 32
#define VPRCSR_BKPT 1
#define VPRCSR_VIOPINS 0x0000000F
#define VPRCSR_VEVIF_NTASKS_MIN 0
#define VPRCSR_VEVIF_NTASKS_MAX 15
#define VPRCSR_VEVIF_NTASKS_SIZE 16
#define VPRCSR_VEVIF_TASKS_MASK 0x0000FFF0
#define VPRCSR_VEVIF_NDPPI_MIN 8
#define VPRCSR_VEVIF_NDPPI_MAX 11
#define VPRCSR_VEVIF_NDPPI_SIZE 12
#define VPRCSR_VEVIF_NEVENTS_MIN 12
#define VPRCSR_VEVIF_NEVENTS_MAX 15
#define VPRCSR_VEVIF_NEVENTS_SIZE 16
#define VPRCSR_BEXT 0
#define VPRCSR_CACHE_EN 0
#define VPRCSR_OUTMODE_VPR1_2 1
#define VPRCSR_VPR_BUS_PRIO 0
#define VPRCSR_NMIMPID_VPR1_3_3 0

/*VPR CLIC registers*/
#define CLIC_PRESENT 1
#define CLIC_COUNT 1

#define VPRCLIC_IRQ_COUNT 16
#define VPRCLIC_IRQNUM_MIN 0
#define VPRCLIC_IRQNUM_MAX 479
#define VPRCLIC_IRQNUM_SIZE 480
#define VPRCLIC_CLIC_NTASKS_MIN 0
#define VPRCLIC_CLIC_NTASKS_MAX 15
#define VPRCLIC_CLIC_NTASKS_SIZE 16
#define VPRCLIC_CLIC_TASKS_MASK 0x0000FFF0
#define VPRCLIC_COUNTER_IRQ_NUM 16
#define VPRCLIC_CLIC_VPR_1_2 1

/*VTIM CSR registers*/
#define VTIM_PRESENT 1
#define VTIM_COUNT 1

/*Factory Information Configuration Registers*/
#define FICR_PRESENT 1
#define FICR_COUNT 1

/*USBHSCORE*/
#define USBHSCORE_PRESENT 1
#define USBHSCORE_COUNT 1

/*I3CCORE*/
#define I3CCORE_PRESENT 1
#define I3CCORE_COUNT 2

/*DMU*/
#define DMU_PRESENT 1
#define DMU_COUNT 2

/*MCAN*/
#define MCAN_PRESENT 1
#define MCAN_COUNT 2

/*System Trace Macrocell data buffer*/
#define STMDATA_PRESENT 1
#define STMDATA_COUNT 1

/*TDDCONF*/
#define TDDCONF_PRESENT 1
#define TDDCONF_COUNT 1

#define TDDCONF_FEATEN_TDDCONF_CLK_320MHZ 0
#define TDDCONF_FEATEN_TDDCONF_CLK_400MHZ 1

/*System Trace Macrocell*/
#define STM_PRESENT 1
#define STM_COUNT 1

/*Trace Port Interface Unit*/
#define TPIU_PRESENT 1
#define TPIU_COUNT 1

/*Cross-Trigger Interface control*/
#define CTI_PRESENT 1
#define CTI_COUNT 2

/*ATB Replicator module*/
#define ATBREPLICATOR_PRESENT 1
#define ATBREPLICATOR_COUNT 4

/*ATB funnel module*/
#define ATBFUNNEL_PRESENT 1
#define ATBFUNNEL_COUNT 4

/*GPIO Tasks and Events*/
#define GPIOTE_PRESENT 1
#define GPIOTE_COUNT 2

#define GPIOTE130_IRQ_COUNT 2
#define GPIOTE130_GPIOTE_NCHANNELS_MIN 0
#define GPIOTE130_GPIOTE_NCHANNELS_MAX 7
#define GPIOTE130_GPIOTE_NCHANNELS_SIZE 8
#define GPIOTE130_GPIOTE_NPORTEVENTS_MIN 0
#define GPIOTE130_GPIOTE_NPORTEVENTS_MAX 3
#define GPIOTE130_GPIOTE_NPORTEVENTS_SIZE 4
#define GPIOTE130_GPIOTE_NINTERRUPTS_MIN 0
#define GPIOTE130_GPIOTE_NINTERRUPTS_MAX 1
#define GPIOTE130_GPIOTE_NINTERRUPTS_SIZE 2
#define GPIOTE130_HAS_PORT_EVENT 1

#define GPIOTE131_IRQ_COUNT 2
#define GPIOTE131_GPIOTE_NCHANNELS_MIN 0
#define GPIOTE131_GPIOTE_NCHANNELS_MAX 7
#define GPIOTE131_GPIOTE_NCHANNELS_SIZE 8
#define GPIOTE131_GPIOTE_NPORTEVENTS_MIN 0
#define GPIOTE131_GPIOTE_NPORTEVENTS_MAX 3
#define GPIOTE131_GPIOTE_NPORTEVENTS_SIZE 4
#define GPIOTE131_GPIOTE_NINTERRUPTS_MIN 0
#define GPIOTE131_GPIOTE_NINTERRUPTS_MAX 1
#define GPIOTE131_GPIOTE_NINTERRUPTS_SIZE 2
#define GPIOTE131_HAS_PORT_EVENT 1

/*Global Real-time counter*/
#define GRTC_PRESENT 1
#define GRTC_COUNT 1

#define GRTC_IRQ_COUNT 3
#define GRTC_MSBWIDTH_MIN 0                          /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_MSBWIDTH_MAX 14                         /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_MSBWIDTH_SIZE 15                        /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_NCC_MIN 0
#define GRTC_NCC_MAX 15
#define GRTC_NCC_SIZE 16
#define GRTC_NTIMEOUT_MIN 0
#define GRTC_NTIMEOUT_MAX 15
#define GRTC_NTIMEOUT_SIZE 16
#define GRTC_NDOMAIN_MIN 0
#define GRTC_NDOMAIN_MAX 15
#define GRTC_NDOMAIN_SIZE 16
#define GRTC_GRTC_NINTERRUPTS_MIN 0
#define GRTC_GRTC_NINTERRUPTS_MAX 2
#define GRTC_GRTC_NINTERRUPTS_SIZE 3
#define GRTC_PWMREGS 1
#define GRTC_CLKOUTREG 1
#define GRTC_CLKSELREG 1
#define GRTC_CLKSELLFLPRC 0
#define GRTC_CCADD_WRITE_ONLY 0
#define GRTC_READY_STATUS_AND_EVENTS 0

/*Trace buffer monitor*/
#define TBM_PRESENT 1
#define TBM_COUNT 1

