pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_ppr_peripherals.h
#define SPIM137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM137_MAX_DATARATE 8
#define SPIM137_EASYDMA_MAXCNT_MIN 0
#define SPIM137_EASYDMA_MAXCNT_MAX 14
#define SPIM137_EASYDMA_MAXCNT_SIZE 15
#define SPIM137_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM137_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM137_FEATURE_RXDELAY_PRESENT 1
#define SPIM137_STALL_STATUS_PRESENT 0
#define SPIM137_STALL_STATUS_TX_PRESENT 0
#define SPIM137_NUM_CHIPSELECT_MIN 0
#define SPIM137_NUM_CHIPSELECT_MAX 0
#define SPIM137_NUM_CHIPSELECT_SIZE 1
#define SPIM137_CORE_FREQUENCY 16
#define SPIM137_PRESCALER_PRESENT 1
#define SPIM137_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM137_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM137_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM137_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM137_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM137_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM137_RXDELAY_RESET_VALUE 2
#define SPIM137_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM137_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM137_RXDELAY_FIELD_WIDTH_SIZE 3

/*UART with EasyDMA*/
#define UARTE_PRESENT 1
#define UARTE_COUNT 9

#define UARTE120_EASYDMA_MAXCNT_MIN 0
#define UARTE120_EASYDMA_MAXCNT_MAX 14
#define UARTE120_EASYDMA_MAXCNT_SIZE 15
#define UARTE120_TIMEOUT_INTERRUPT 1
#define UARTE120_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE120_CORE_FREQUENCY 320
#define UARTE120_CORE_CLOCK_320 1
#define UARTE120_SHORTS_ENDTX_STOPTX 1
#define UARTE120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE130_EASYDMA_MAXCNT_MIN 0
#define UARTE130_EASYDMA_MAXCNT_MAX 14
#define UARTE130_EASYDMA_MAXCNT_SIZE 15
#define UARTE130_TIMEOUT_INTERRUPT 1
#define UARTE130_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE130_CORE_FREQUENCY 16
#define UARTE130_CORE_CLOCK_16 1
#define UARTE130_SHORTS_ENDTX_STOPTX 1
#define UARTE130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE131_EASYDMA_MAXCNT_MIN 0
#define UARTE131_EASYDMA_MAXCNT_MAX 14
#define UARTE131_EASYDMA_MAXCNT_SIZE 15
#define UARTE131_TIMEOUT_INTERRUPT 1
#define UARTE131_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE131_CORE_FREQUENCY 16
#define UARTE131_CORE_CLOCK_16 1
#define UARTE131_SHORTS_ENDTX_STOPTX 1
#define UARTE131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE132_EASYDMA_MAXCNT_MIN 0
#define UARTE132_EASYDMA_MAXCNT_MAX 14
#define UARTE132_EASYDMA_MAXCNT_SIZE 15
#define UARTE132_TIMEOUT_INTERRUPT 1
#define UARTE132_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE132_CORE_FREQUENCY 16
#define UARTE132_CORE_CLOCK_16 1
#define UARTE132_SHORTS_ENDTX_STOPTX 1
#define UARTE132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE133_EASYDMA_MAXCNT_MIN 0
#define UARTE133_EASYDMA_MAXCNT_MAX 14
#define UARTE133_EASYDMA_MAXCNT_SIZE 15
#define UARTE133_TIMEOUT_INTERRUPT 1
#define UARTE133_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE133_CORE_FREQUENCY 16
#define UARTE133_CORE_CLOCK_16 1
#define UARTE133_SHORTS_ENDTX_STOPTX 1
#define UARTE133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE134_EASYDMA_MAXCNT_MIN 0
#define UARTE134_EASYDMA_MAXCNT_MAX 14
#define UARTE134_EASYDMA_MAXCNT_SIZE 15
#define UARTE134_TIMEOUT_INTERRUPT 1
#define UARTE134_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE134_CORE_FREQUENCY 16
#define UARTE134_CORE_CLOCK_16 1
#define UARTE134_SHORTS_ENDTX_STOPTX 1
#define UARTE134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE135_EASYDMA_MAXCNT_MIN 0
#define UARTE135_EASYDMA_MAXCNT_MAX 14
#define UARTE135_EASYDMA_MAXCNT_SIZE 15
#define UARTE135_TIMEOUT_INTERRUPT 1
#define UARTE135_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE135_CORE_FREQUENCY 16
#define UARTE135_CORE_CLOCK_16 1
#define UARTE135_SHORTS_ENDTX_STOPTX 1
#define UARTE135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE136_EASYDMA_MAXCNT_MIN 0
#define UARTE136_EASYDMA_MAXCNT_MAX 14
#define UARTE136_EASYDMA_MAXCNT_SIZE 15
#define UARTE136_TIMEOUT_INTERRUPT 1
#define UARTE136_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE136_CORE_FREQUENCY 16
#define UARTE136_CORE_CLOCK_16 1
#define UARTE136_SHORTS_ENDTX_STOPTX 1
#define UARTE136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE137_EASYDMA_MAXCNT_MIN 0
#define UARTE137_EASYDMA_MAXCNT_MAX 14
#define UARTE137_EASYDMA_MAXCNT_SIZE 15
#define UARTE137_TIMEOUT_INTERRUPT 1
#define UARTE137_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE137_CORE_FREQUENCY 16
#define UARTE137_CORE_CLOCK_16 1
#define UARTE137_SHORTS_ENDTX_STOPTX 1
#define UARTE137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

/*Real-time counter*/
#define RTC_PRESENT 1
#define RTC_COUNT 2

#define RTC130_CC_NUM_MIN 0
#define RTC130_CC_NUM_MAX 3
#define RTC130_CC_NUM_SIZE 4
#define RTC130_BIT_WIDTH_MIN 0
#define RTC130_BIT_WIDTH_MAX 23
#define RTC130_BIT_WIDTH_SIZE 24
#define RTC130_LFCLK_ENABLE 0

#define RTC131_CC_NUM_MIN 0
#define RTC131_CC_NUM_MAX 3
#define RTC131_CC_NUM_SIZE 4
#define RTC131_BIT_WIDTH_MIN 0
#define RTC131_BIT_WIDTH_MAX 23
#define RTC131_BIT_WIDTH_SIZE 24
#define RTC131_LFCLK_ENABLE 0

/*Watchdog Timer*/
#define WDT_PRESENT 1
#define WDT_COUNT 2

#define WDT131_ALLOW_STOP 0
#define WDT131_HAS_INTEN 0

#define WDT132_ALLOW_STOP 0
#define WDT132_HAS_INTEN 0

/*Event generator unit*/
#define EGU_PRESENT 1
#define EGU_COUNT 1

#define EGU130_PEND 0
#define EGU130_CH_NUM_MIN 0
#define EGU130_CH_NUM_MAX 7
#define EGU130_CH_NUM_SIZE 8

/*GPIO Port*/
#define GPIO_PRESENT 1
#define GPIO_COUNT 10

#define P0_CTRLSEL_MAP1 1
#define P0_CTRLSEL_MAP2 0
#define P0_CTRLSEL_MAP3 0
#define P0_PIN_NUM_MIN 0
#define P0_PIN_NUM_MAX 12
#define P0_PIN_NUM_SIZE 13
#define P0_FEATURE_PINS_PRESENT 0x00001FFFUL
#define P0_DRIVECTRL 0
#define P0_RETAIN 1
#define P0_PWRCTRL 0
#define P0_PIN_OWNER_SEC 0
#define P0_BIASCTRL 0

#define P1_CTRLSEL_MAP1 1
#define P1_CTRLSEL_MAP2 0
#define P1_CTRLSEL_MAP3 0
#define P1_PIN_NUM_MIN 0
#define P1_PIN_NUM_MAX 11
#define P1_PIN_NUM_SIZE 12
#define P1_FEATURE_PINS_PRESENT 0x00000FFFUL
#define P1_DRIVECTRL 0
#define P1_RETAIN 1
#define P1_PWRCTRL 0
#define P1_PIN_OWNER_SEC 0
#define P1_BIASCTRL 0

#define P2_CTRLSEL_MAP1 1
#define P2_CTRLSEL_MAP2 0
#define P2_CTRLSEL_MAP3 0
#define P2_PIN_NUM_MIN 0
#define P2_PIN_NUM_MAX 11
#define P2_PIN_NUM_SIZE 12
#define P2_FEATURE_PINS_PRESENT 0x00000FFFUL
#define P2_DRIVECTRL 0
#define P2_RETAIN 1
#define P2_PWRCTRL 0
#define P2_PIN_OWNER_SEC 0
#define P2_BIASCTRL 0

